Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/P17.tmx
Source language: en_us
Languages: zh_cn

source: Awak
zh_cn: 夜未眠

source: "Odysseus turned his back on the harbour and followed a rough track leading through the woods and up to the hills toward the place where Athene had told him . . ."
zh_cn: “奥德修斯转过身，背对港口，沿着坎坷的小路，穿过森林，爬上山丘，往雅典娜告诉他的那个地方前去......”

source: Richard read on for a time.
zh_cn: 理查德又读了一会儿书。

source: He was restless but tried to take an interest in Odysseus' journey to the home of his loyal "swineherd"- what a word, what a way to make a living!- who of course doesn't recognize him, nobody ever recognized anybody in these old books, but offers Odysseus a meal anyway and bangs his ear off with complaints.
zh_cn: 他焦躁不安，不过仍努力集中精神，关注着奥德修斯前往他忠诚“猪倌”家的旅程。“猪倌”？好一个词儿，好一个谋生的行当。“猪倌”当然不认识奥德修斯——这种老书里，谁都不认识谁——不过他还是让奥德修斯吃了一顿饭，对着他抱怨一通。

source: Now and then Richard glanced over at Ana, asleep beside him.
zh_cn: 理查德不时瞄一眼睡在旁边的安娜。

source: He kept willing her to wake, to turn and open her arms to him- no such luck.
zh_cn: 他一直希望安娜醒过来，转过身，向他张开双臂——当然没有那么好运。

source: Gloomy, impatient, he went back to the Odyssey.
zh_cn: 带着忧郁、不耐烦的心情，他又继续开始读《奥德赛》。

source: Ana had left it on the bedside table, open to this chapter, which Richard found boring and implausible.
zh_cn: 《奥德赛》是安娜放在桌上的，书刚好翻开在这一章。

source: He leafed ahead to the part where Odysseus strings his bow and slaughters all the suitors, but there was a lot more fancy description and speechifying than he remembered from the version he'd read as a kid.
zh_cn: 理查德觉得这章无聊、不合情理，便向后翻到奥德修斯拉弓杀掉所有求婚者的那一部分。不过比起小时读的那个版本，他现在读的这个版本里描写更为奇幻，言语更具气势。

source: He was supposed to have read it again, a couple years ago, as part of his freshman core at Columbia, but he'd come down with the flu that week.
zh_cn: 几年前刚到哥伦比亚大学上学时，这本书是新生必读书目之一，他那时就应该重读的，不过那个星期他刚好患了流感，就与这本书失之交臂了。

source: It was a library book.
zh_cn: 这是一本图书馆借来的书。

source: He studied the withdrawal dates- few of them and far between- then closed it and put it back down.
zh_cn: 他细看了借出的日期，借出的次数不多，间隔时间很长。然后他又合上书，把书放回了桌上。

source: Ana had only stirred a little when he turned on the lamp.
zh_cn: 理查德刚才打开台灯时，安娜只是轻轻动了一下。

source: Now he switched it off and plumped his pillow and fooled with the covers, hoping that all this would do the trick, but she slept on, snoring softly, face to the wall.
zh_cn: 现在，他关掉灯，拍了拍枕头，故意玩着枕巾，希望能把安娜弄醒，不过安娜还是熟睡着，面对着墙，轻声打着鼾。

source: The bed was narrow, and in the dark he became even more aware of the heat from her back and her legs, especially her legs.
zh_cn: 床并不宽，再加上关了灯，理查德更能感受到安娜背部和双腿，特别是双腿，散发出的热量。

source: He touched his knee to the tender crook of hers and she drew away, leaving him jangly and resentful, but conscious also that he had no right to be, that she'd already given herself twice that night and had to get up early with a full day of waitressing ahead of her; he had only one class to attend, in the afternoon.
zh_cn: 他用膝盖去碰安娜的腿弯，可安娜挪了挪，避开了他。他有些生气，但是他也晓得，他不应该这样，安娜这晚已经和他云雨了两次，而且明天还要早起，在餐馆做服务员，整整工作一天。而他只有一节课，还是在下午。

source: But knowing this did not take the edge off his need- for it felt like need, nothing less- to have her against him again, her open mouth moving on his, her fingers digging into his back.
zh_cn: 尽管这样，他对安娜的需要——就是需要，不是其它的——没有丝毫减弱，他需要安娜转过身来，手指扣到自己的背里面，张开香唇和自己激吻。

source: Jesus!
zh_cn: 天！

source: He had to think of something else.
zh_cn: 他必须得想想其它的事。

source: But what?
zh_cn: 可想什么呢？

source: Even thinking of something else, he'd know that he was doing it to distract himself, and that thought would lead right back to this bed, to the weight of Ana beside him, her breath, her heat.
zh_cn: 就是想着其它的事情，他也知道自己是为了转移注意力，然后思绪又会马上回到床上，回到身边的安娜身上，想着她的呼吸、她的体温。

source: Still, if he kept it up long enough maybe he'd fall asleep, or at least be awake and ready when her alarm went off.
zh_cn: 话说回来，他要是一直想，想久了也许也能睡着。或者也可以一直醒着，等着安娜的闹钟响时和她恩爱一番。

source: Not that he'd pressure her.
zh_cn: 他不会强迫安娜。

source: Unless they hurried, which she didn't like, she'd have to go to work without breakfast or a shower.
zh_cn: 如果不是匆忙完事的话（安娜不喜欢这样），安娜就得饿着肚子，不洗澡就去上班。

source: He'd just give her a look, his special look, and she'd know, and then she could do whatever she wanted.
zh_cn: 他只需看着安娜，用特别的眼神看着安娜，安娜就知到他的想法，与不与他恩爱都全则由她做主。

source: And he wouldn't act hurt if she didn't want to.
zh_cn: 安娜若是不想，他也不会表现出伤心委屈。

source: Really, he wouldn't. Not this time.
zh_cn: 实话说不会，至少这次不会。

source: Think of something else.
zh_cn: 想想别的事情吧。

source: O.K. "The Exorcist"- this old novel he'd found in his dormitory lounge.
zh_cn: 那好，想想那本在宿舍大厅得到的旧小说《驱魔人》。

source: Richard had seen the movie with the possessed girl whose head spins on her neck like a top, but he hadn't known that it came from a book- not that the book was great literature or anything.
zh_cn: 理查德之前看过电影，电影里那个魔鬼附身的女孩，脑袋在脖子上面转动得像陀螺一样，不过理查德那时还不知道电影改编自这本书——这本书又不是什么文学名著之类的。

source: Still, it was pretty interesting.
zh_cn: 当然了，这本书还是趣味十足。

source: The writer had done a lot of research on exorcisms, and some of the cases were scary enough to make you believe in the Devil, at least while you were reading the novel.
zh_cn: 作者就驱魔一事做了许多调查，其中有些事例十分恐怖，足以让你相信，或者说至少在读书的时候让你相信魔鬼存在。

source: It turned out that there were certain priests who cast out demons as a specialty.
zh_cn: 实际上，有些牧师的专长就是驱魔。

source: That was their job, their market niche, waiting around like firemen for the alarm to go off.
zh_cn: 驱魔就是他们的工作，他们挣钱的行当。他们等待魔鬼出现，就好像消防员等待火灾警报响起一样。

source: Demon in Idaho housewife!
zh_cn: 爱达荷州的家庭主妇被魔鬼附身！

source: Demon in Delaware bus driver!
zh_cn: 特拉华州公交司机被魔鬼附身！

source: How weird was that?
zh_cn: 奇怪吧？

source: As if being a priest weren't strange enough already.
zh_cn: 好像牧师本身还不够奇怪似的。

source: Richard had been sort of religious when he was young, he'd said prayers before meals and gone to Sunday school, where he'd stuck cutouts of bearded men onto felt backdrops.
zh_cn: 理查德小的时候，也有些信仰宗教，吃饭前要做祷告，去主日学校上学前也要做祷告。在主日学校时，他往放到地上的幕布上贴过剪切的大胡子人像。

source: Church was fine, he'd always felt good afterward.
zh_cn: 做礼拜也还好，礼拜过后他总感觉不错。

source: He could even see maybe becoming religious again someday, when he was a lot older.
zh_cn: 他甚至觉得，多年后的某一天，还或许会重新信教。

source: But giving up women?
zh_cn: 但是要让自己不碰女人？

source: Never kissing a woman, never having a woman's legs around you-
zh_cn: 不吻女人，不让女人双腿绕着自己的身体......？

source: He sat up and reached for the glass of water Ana had left for him on the bedside table.
zh_cn: 他坐起来，伸手拿来安娜为他准备在床头桌上的水杯。

source: He'd knocked it over last weekend and made enough of a fuss to wake her, but he didn't think he should try that again, so he took care picking it up and putting it down after he'd drunk his fill.
zh_cn: 上个星期，他还就碰翻了杯子，小题大做吵醒了安娜。不过这次却不能故技重施，所以他拿水杯时小心翼翼，喝满意后放回去时也轻手轻脚。

source: He settled back against the pillow.
zh_cn: 他又躺回枕头上，闭上了眼睛。

source: He closed his eyes, but just then Ana made a little snort and moved beside him, giving off a fresh wave of warmth, and, faintly, that sweet warm bed-smell of hers, like baking bread, and he lay there tensed, waiting, but she didn't move again.
zh_cn: 安娜低声哼了哼，动了动身子，又煽动出一阵温热，一阵她睡觉时的温暖甜蜜的体香，就像烤面包的香味一样。他紧张不安地躺着等待，可是安娜再没有移动身体。

source: He heard the clock tick, his own breath returning, jagged and raspy.
zh_cn: 他听着时钟的指针滴答滴答不停跳动，安娜的体香散去，他的呼吸又变得浮躁无律。

source: He looked up toward the ceiling, at a thin bar of light leaking though the shades from the street lamp outside.
zh_cn: 窗外的街灯穿过窗帘间的缝隙，在天花板上泄下一道微弱的光。理查德抬起视线，看着这道光。

source: No more thinking about priests- that didn't help.
zh_cn: 再不要想牧师的事了，没有用的。

source: O.K., then, the Odyssey.
zh_cn: 好吧，那继续想想《奥德赛》吧。

source: He should read it again.
zh_cn: 这本书他应该再读一遍的。

source: He was going to, for sure, this time in the grownup version!
zh_cn: 这次他真打算再读一遍，读成人版的。

source: He could get through a few speeches and descriptions, sort of earn his way to the good parts, especially the slaughter at the end.
zh_cn: 书中少数的高谈阔论和奇幻描写，他也能坚持读下去，算得上是跌跌撞撞才读到精彩的部分，特别是奥德修斯最后屠杀求婚者的那部分。

source: He liked the idea of Odysseus coming home after all his wanderings and screwups and setting things right, taking back his woman and his house, no discussion, no messing around.
zh_cn: 他很乐意看到奥德修斯浪迹四方、历经苦难、摆平一切后，回家夺回王宫，与妻子团聚，不再谈判，不再征战。

source: Then he would read the Iliad. Also "War and Peace" and "The Brothers Karamazov."
zh_cn: 读完《奥德赛》，他接着会读《伊利亚特》，还会读《战争与和平》和《卡拉马佐夫兄弟》。

source: All the books that Ana had on her shelf, and actually liked.
zh_cn: 这些书安娜都放在书架上，而且还情有独钟。

source: Richard was an econ major and didn't have much time for outside reading, and when he did he kicked back with a mystery, or something scary.
zh_cn: 理查德的专业是经济学，没有太多时间阅读专业外书籍。有时间的时候，他就读神话或者恐怖之类的书。

source: O.K., so he wasn't a big literary type- so sue him!
zh_cn: 所以，他不是个迂腐的书呆子。所以，找男朋友就找他吧。

source: He'd like to see one of those sensitive souls handle the stuff he was dealing with in his International Environmental Economics seminar.
zh_cn: 在国际环境经济学研讨班上，他乐意某个敏感的家伙过来替他干自己正在干的事。

source: Abatement Strategy Modules.
zh_cn: 消减策略模块？

source: Alternative Equity Criteria.
zh_cn: 替代性投资标准？

source: General Equilibrium Impact Analyses.
zh_cn: 一般均衡影响分析？

source: Go for it, he thought. Be my fucking guest.
zh_cn: 都交给你了，他想，别他妈客气。

source: Not that Ana was like that- a snob. She wasn't.
zh_cn: 并不是说安娜势利；她并不势利。

source: She really loved these books, they were important to her, and Richard knew that he hadn't been entirely honest about his own tastes when they first met.
zh_cn: 安娜热爱那些经典名著，于她而言名著十分重要。理查德知道，初次和安娜见面时，自己不实在，并没有实打实地让安娜知道自己的喜好。

source: He'd allowed her to think that he was a great one for the classics, and she had believed him because she had the idea that Columbia students were not only smart but cultured, and that they went to the university not to set themselves up for a fat job later on but to search for knowledge and wisdom. To become better people.
zh_cn: 他让安娜以为自己爱好名著经典，安娜信了他，因为她以为哥大学生又聪明又有修养，他们上大学不是为了找个好工作，而是为了寻求知识和智慧，变得更为优秀。

source: She was naive that way.
zh_cn: 她居然会这样想，真是天真。

source: Richard had liked her innocence, and the sense of adult benevolence it gave him.
zh_cn: 那时理查德喜欢安娜的纯真无邪，喜欢她给自己一种成人关怀的感觉。

source: She was a few years older than he, and at first it sort of evened things out, him knowing the score while humoring her, letting her have her notions.
zh_cn: 安娜大他几岁，起初这年龄的差距让事情顺风顺水，理查德明白安娜年长，也就迎合安娜，那样让安娜知道实情。

source: That was how he saw it then, in the beginning. Not anymore.
zh_cn: 才开始时，他的看法就是这样，但是现在已经不是了。

source: After two months with Ana, he knew himself to be the green, untested one.
zh_cn: 和安娜再一起两个月后，他知道，他们两人中自己才是那个没有经历的新手。

source: Her family was Russian but they'd lived for many years in Chechnya, where her father managed a food-processing plant.
zh_cn: 安娜来自一个俄罗斯家庭，但是她一家在车臣住过好几年。父亲在车臣管理着一家食物加工厂。

source: During the war, the factory had been destroyed and Ana's oldest brother had been killed. The family lost everything.
zh_cn: 战争的时候，工厂毁于一旦，大哥命丧黄泉，一家人变得一无所有。

source: She'd been sent to live with her mother's mother in Tel Aviv- a widow, mean as a witch from some fairy tale.
zh_cn: 安娜被送去特拉维夫，与外婆一起生活。外公已经离世，外婆刻薄吝啬，像是个童话里跑来的女巫一样。

source: Now she was staying with an aunt here in Queens, and working illegally at a restaurant on Amsterdam.
zh_cn: 现在，安娜和一位婶婶一起住在皇后区，在阿姆斯特丹大街上的一家餐馆打黑工。

source: That was where Richard had met her. He'd heard her speaking Russian to another waitress, and when she came to his table he tried out a few phrases from his one year of high-school Russian, and she had almost wept with surprise and joy.
zh_cn: 理查德就是在这家餐馆碰到了她，他听到安娜和别的服务员说俄语，等安娜来到他的桌边时，他试着用高中时学的一年俄语憋出了几个词，让安娜又惊又喜，差点哭了出来。

source: She wasn't his type, Ana- a bit heavy, round in the face. Little pockmarks on her forehead.
zh_cn: 安娜不是他的菜。她身材微胖胖，圆脸，前额还有小小的痘痕。

source: Her English was pretty good but thickly accented.
zh_cn: 她英语相当不错，只是口音太重。

source: He hadn't meant to ask her out. But then he did, the very next night.
zh_cn: 他本没有打算约她出来，可第二天还是约了她。

source: A week later she took him home, to this small attic room in her aunt's house.
zh_cn: 过了一个星期，安娜就把他带回了家，带他去了自己在婶婶家的小阁楼房间里。

source: They were just having fun, that was how he'd seen it, the two of them having some fun before going their separate ways, as people did, people their age with their whole lives still ahead of them.
zh_cn: 在理查德看来，他们只是玩玩而已，和岁数不大、命还很长的人们一样，玩开心后就分道扬镳。

source: You didn't want to get tied down now, when you didn't know who you might still meet and what might open up, what chances and adventures.
zh_cn: 你现在不晓得以后会和谁邂逅，不晓得会发生什么，不晓得会遇到什么样的机会，不晓得会历经何事，所以你不想被束缚，不想被牵制。

source: That was the idea. Some good times, no strings.
zh_cn: 就是这样，要玩得开心，而且不要被束缚。

source: But after a month or so he saw that Ana had gone all serious on him. She tried to pretend she hadn't, but she had, and he knew it, and made up his mind to break things off.
zh_cn: 可个把月过后，他发现安娜对他严肃起来，她虽然努力假装，但仍然难掩事实。

source: It would be wrong to take advantage of her.
zh_cn: 理查德也清楚，所以下了决心要和安娜一刀两断。

source: Also the long subway ride from his dorm and back was getting to him.
zh_cn: 一直占安娜的便宜不好，而且从宿舍到安娜家往返坐长时间的地铁也让他有些恼火。

source: But then he found that he couldn't break it off, because even with friends, even talking to other girls, he missed her, missed her throaty voice and the strange, direct way she said things, missed giving her pleasure and seeing it in her eyes.
zh_cn: 但是后来他发现要分手办不到，因为和朋友一起时，甚至和别的女生聊天时，他都想念着安娜，想念她沙哑的嗓音，想念她说话时的坦率，想念让安娜开心时，看着她眼中泛着快乐的那种感觉。

source: He was desolate on the nights that he had to sleep in his dorm room.
zh_cn: 被迫一个人在宿舍睡觉的那些夜晚，他感觉到万分孤寂。

source: Loud voices outside- men's voices, speaking in Spanish.
zh_cn: 屋外几个男人讲着西班牙语，传来喧闹的说话声。

source: Ana shifted, murmured.
zh_cn: 安娜翻了翻身，嘴里念念有词。

source: The voices moved on. Silence.
zh_cn: 说话声渐渐走远，最后又消失成一片寂静。

source: Richard sat up and took another drink of water.
zh_cn: 理查德坐起来，又喝了一口水。

source: Being away from her felt unnatural now.
zh_cn: 现在的他，要是不和安娜在一起，就感觉很别扭。

source: Alone in bed, sitting in class, writing an e-mail to his parents, he thought of her and ached.
zh_cn: 一个人在床上时，坐在教室里时，给父母写电邮时，他都想念着安娜，隐隐作痛。

source: But it couldn't last- he knew that.
zh_cn: 可是他知道，事情不可能一直这样。

source: And he knew now that she would be the one to break it off.
zh_cn: 他现在晓得，安娜会是提出分手的那个。

source: Ana was already who she was going to be, and he was not.
zh_cn: 安娜已经露出了真实面目，他还没有。

source: She was a woman, and he was not a man.
zh_cn: 安娜是女人，他不是男人。

source: He looked like a man, even an interesting man, dark and ruggedly handsome, with a grave, thoughtful air.
zh_cn: 他外表是男人，甚至是一个有趣的男人，肤色暗黑，面孔棱角分明、帅气十足，给人一种庄重、体贴的感觉。

source: But his looks didn't fit the way he felt- the way he knew himself to be.
zh_cn: 可是他的外表与自己的感觉、与自己所知的自己并不符合。

source: Sometimes, walking down the street, he glanced at the window of a store and was thrown by the sight of himself, as if he were wearing a costume.
zh_cn: 有些时候，他从街上走过，看到店铺窗户上倒映的自己就心烦意乱，好像自己身上套着衣服在演戏一样。

source: Girls liked him. They assumed certain things about him, and he'd learned to act his part, but he knew this wouldn't hold up much longer with Ana.
zh_cn: 姑娘们倒是喜欢他，她们以为他应该是这样的，或者应该是那样的，他已经学会了演好自己的戏份。

source: Not because she was older but because his ways of thinking were smaller than hers.
zh_cn: 不过他知道，和安娜一起，这样的假装不会持续太久，不是因为安娜年长，而是因为安娜的思维比他的广阔。

source: He wasn't curious, as she was, didn't like and trust others, as she did, for all the hardships of her life.
zh_cn: 他没有好奇心，安娜有；他不喜欢、不信任别人，可安娜经历过困难的生活，能喜欢、信任别人。

source: He complained a lot, and she never complained.
zh_cn: 他成天抱怨这抱怨那，而安娜从来不吐一句怨言。

source: And though he hated being apart from her, when they were out together he looked at other women and imagined having them, and even brought their images to this bed.
zh_cn: 理查德虽然讨厌和安娜分开，但是两人一起出去时，他又要看别的女人，想象拥有她们，甚至和安娜同床共枕时也想着她们的样子。

source: Sometimes she caught him studying her coldly- wishing she'd lose weight, do something about those pockmarks- and he could feel his own smallness and triviality as the color drained from her face.
zh_cn: 有时候，安娜发现他面无表情地观察着自己（心里希望她减肥，或者想法子祛祛痘痕）。他看着安娜两颊绯红逐渐褪去时，能感受到自己的渺小和平凡。

source: Soon enough she would see him clearly, and understand her mistake.
zh_cn: 很快安娜就会把他看透，知道自己看错了人。

source: He was already watching for signs of retreat: impatience, condescension, a certain weariness.
zh_cn: 他已经在等待退却的信号——没有耐心、看不起人、某方面表现出厌倦。

source: He'd seen all this before, with the only other girl he'd been close to.
zh_cn: 这一切，在与那个他唯一亲近的女孩一起时，他都见过。

source: Had Ana really not caught on yet?
zh_cn: 安娜还没懂吗？

source: How could she not know?
zh_cn: 她这么可能不知道？

source: Was it just because he was handsome, and always ready?
zh_cn: 仅仅是因为他帅气，而且随叫随到吗？

source: Or because he was American, and maybe of use in some scheme?
zh_cn: 或者是因为他是美国人，或许可以利用来谋划些事情？
